In [7]:
import numpy as np
import pandas as pd

In [8]:
df=pd.read_csv("heart.csv")
df

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,52,1,0,125,212,0,1,168,0,1.0,2,2,3,0
1,53,1,0,140,203,1,0,155,1,3.1,0,0,3,0
2,70,1,0,145,174,0,1,125,1,2.6,0,0,3,0
3,61,1,0,148,203,0,1,161,0,0.0,2,1,3,0
4,62,0,0,138,294,1,1,106,0,1.9,1,3,2,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1020,59,1,1,140,221,0,1,164,1,0.0,2,0,2,1
1021,60,1,0,125,258,0,0,141,1,2.8,1,1,3,0
1022,47,1,0,110,275,0,0,118,1,1.0,1,1,2,0
1023,50,0,0,110,254,0,0,159,0,0.0,2,0,2,1
1024,54,1,0,120,188,0,1,113,0,1.4,1,1,3,0

In [9]:
df['Sex1'] = df.sex.replace({1: "Male", 0: "Female"})

In [12]:
dx = df[["target", "Sex1"]].dropna()
dx

      target    Sex1
0          0    Male
1          0    Male
2          0    Male
3          0    Male
4          0  Female
...      ...     ...
1020       1    Male
1021       0    Male
1022       0    Male
1023       1  Female
1024       0    Male

[1025 rows x 2 columns]

In [13]:
p_fm = 25/(72+25)
n = 72+25

In [15]:
se_female = np.sqrt(p_fm * (1 - p_fm) / n)
se_female

0.044409783007282766

In [16]:
z_score = 1.96
lcb = p_fm - z_score* se_female  
ucb = p_fm + z_score* se_female

In [19]:
lcb

0.17068878406861235

In [18]:
ucb

0.3447751334571608

In [20]:
p_male = 114/(114+92) 
n = 114+92

In [21]:
se_male = np.sqrt(p_male * (1 - p_male) / n)
se_male

0.03463741785139291

In [22]:
se_diff = np.sqrt(se_female**2 + se_male**2)
se_diff

0.0563203297412749

In [23]:
d = 0.55 - 0.26
lcb = d - 1.96 * se_diff 
ucb = d + 1.96 * se_diff

In [24]:
lcb

0.17961215370710124

In [25]:
ucb

0.4003878462928988

In [27]:
df.groupby("Sex1").agg({"chol": [np.mean, np.std, np.size]})

              chol
              mean        std size
Sex1
Female  261.455128  64.466781  312
Male    239.237027  43.155535  713

In [28]:
mean_fe = 261.75
sd = 64.9 
n = 97 
z = 1.96

In [29]:
se = sd /np.sqrt(n)
se

6.589596611717189

In [38]:
lcb = mean_fe - z* se 
ucb = mean_fe + z* se 
(lcb, ucb)

(248.8343906410343, 274.6656093589657)

In [31]:
n1 = 97
n2 = 206
mean_female = 261.75
mean_male = 239.6
sd_female = 64.9
sd_male = 42.65

In [32]:
sem_female = sd_female / np.sqrt(97)
sem_male = sd_male / np.sqrt(206)

In [40]:
mean_d = mean_female - mean_male
mean_d

22.150000000000006

In [42]:
sem_d = (np.sqrt((n1-1)*se_female**2 + (n2-1)*se_male**2)/(n1+n2-2))*(np.sqrt(1/n1 + 1/n2))
sem_d

0.000269911337051569

In [43]:
lcb = mean_d - 1.96*sem_d 
ucb = mean_d + 1.96*sem_d 
(lcb, ucb)

(22.149470973779383, 22.150529026220628)